<a href="https://colab.research.google.com/github/AkankshaB123/python/blob/main/Filtering_within_df(Session15).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
df = pd.read_csv("/content/sample_data/titanic3.csv")
df.head(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

***Filtering Assignment***
1. How many voyagers have paid greater than the mean fare value?
2. How many voyagers paying greater than mean fare are female?
3. How many male voyagers survived?
4. How many female voyagers didn't survive?
5. How many females survived?

Note: Do not hard-code anything. Big tech or large scale companies prefer that

In [9]:
#1. How many voyagers have paid greater than the mean fare value?
#Remember this: within the dataframe filtering
len(df[df['fare']>df['fare'].mean()])

304

In [13]:
#2. How many voyagers paying greater than mean fare are female?
#Remember to have this () within df [] to have multiple conditions
len(df[(df['fare']>df['fare'].mean()) & (df['sex'] == 'female')])

154

In [14]:
#3. How many male voyagers survived?
len(df[df['sex'] == 'male'])

843

In [15]:
len(df[df['sex'] == 'female'])

466

In [20]:
#How many female voyagers didn't survive?
len(df[(df['sex'] == 'female') & (df['survived'] == 0.0)])

127

In [21]:
#How many females survived?
len(df[(df['sex'] == 'female') & (df['survived'] == 1.0)])

339

Replace Values

In [25]:
import numpy as np
df['survived'].replace({0:"No", 1:"Yes", np.nan: "Not Available"})

0                 Yes
1                 Yes
2                  No
3                  No
4                  No
            ...
1305               No
1306               No
1307               No
1308               No
1309    Not Available
Name: survived, Length: 1310, dtype: object

Rename

In [27]:
#column name is the property of df
df.rename(columns = {"sex": "gender"}, inplace=True)

# **Task**
1. Replace all female with Woman and all males with Man in the sex column
2. Rename column 'Survived' with 'Passenger Survival'

In [30]:
#1.Replace all female with Woman and all males with Man in the sex column
df['gender'].replace({"female": "Woman", "male": "Man", np.nan: "Not Available"})

0               Woman
1                 Man
2               Woman
3                 Man
4               Woman
            ...
1305            Woman
1306              Man
1307              Man
1308              Man
1309    Not Available
Name: gender, Length: 1310, dtype: object

In [31]:
#2.Rename column 'Survived' with 'Passenger Survival'
df.rename(columns = {"survived": "Passenger Survival"}, inplace=True)

Finding the Minimum, Maximum, Sum, Average and Count

In [34]:
#Max of each column
df['age'].max()

80.0

In [37]:
#Max of each row - Time Series Data (Row-Axis)
df.max(axis = 1, numeric_only=True) # default - column wise aggregation axis = 0

0       211.3375
1       151.5500
2       151.5500
3       151.5500
4       151.5500
          ...
1305     14.4542
1306    304.0000
1307     27.0000
1308     29.0000
1309         NaN
Length: 1310, dtype: float64

Missing Values - Pre-processing

In [38]:
#Missing Values
df.isnull().sum()/len(df)*100

pclass                 0.076336
Passenger Survival     0.076336
name                   0.076336
gender                 0.076336
age                   20.152672
sibsp                  0.076336
parch                  0.076336
ticket                 0.076336
fare                   0.152672
cabin                 77.480916
embarked               0.229008
boat                  62.900763
body                  90.763359
home.dest             43.129771
dtype: float64